/*===================================================================*/
/*                                                                   */
/*  Type.h : ヘッダファイル(型定義ファイル)                          */
/*                                                                   */
/*  2001/04/10    Jay's Factory                                      */
/*  1999/03/28    M.Brent ( Ami 99 - TI-99エミュレータ  )            */
/*                                                                   */
/*===================================================================*/

#ifndef TYPE_H_INCLUDED
#define TYPE_H_INCLUDED

/*-------------------------------------------------------------------*/
/*  型定義                                                           */
/*-------------------------------------------------------------------*/

#define UINT8   unsigned char
#define Byte    unsigned char
#define Word    unsigned short

#endif    /* #ifndef TYPE_H_INCLUDED */